In [1]:
from lib.climber_class import *

# User

We need to create a user with this same route features
- Grade
- Location
- Cluster
- Heigh

#### Climber atributes

In [4]:
climber_1 = Climber('jordi',44,3,['rum','eidas','ajs niod'],165)
climber_2 = Climber()
display(climber_1.get_data())
display(climber_2.get_data())

Climber class initialized
Climber class initialized

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,3,jordi,0,6b+/6c,44,3,rum,eidas,ajs niod,165

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,4,climber4,0,7b/+,54,2,esp,montserrat,agulla del senglar,170

In [3]:
climber_1.set_attributes(grade = 29)
climber_2.set_attributes(grade_range = 1)
display(climber_1.get_data())
display(climber_2.get_data())

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,0,jordi,0,5,29,3,rum,eidas,ajs niod,165

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,1,climber1,0,7b/+,54,1,esp,montserrat,agulla del senglar,170

#### For routes

In [6]:
routes = pd.read_csv('../data/routes_rated.csv',low_memory=False, index_col=0)

In [7]:
climber_1.add_route_liked(routes.iloc[[13403]])
climber_1.add_route_not_liked(routes.tail(2))
climber_1.add_route(routes.head(1))
display("Routes liked:",climber_1.get_routes_liked())
print()
print()
display("Routes not liked:",climber_1.get_routes_climbed())

'Routes liked:'

,name_id,country,crag,sector,name,tall_recommend_sum,grade_mean,cluster,rating_tot,liked
13403,13403,esp,cocentaina,mas de la penya,demolition man,0,46.75,3,-0.109745,Yes

'Routes not liked:'

,name_id,country,crag,sector,name,tall_recommend_sum,grade_mean,cluster,rating_tot,liked
13403,13403,esp,cocentaina,mas de la penya,demolition man,0,46.75,3,-0.109745,Yes
0,0,and,montserrat,prohibitivo,diagonal de la x,-1,49.25,3,-0.045211,N/A
55856,55856,zaf,van stadens,cleopatra wall,tekel,0,44.00,2,0.439815,No
55857,55857,zaf,waterval boven,baboon buttress,pretenders,0,49.00,2,0.425427,No

Is route already in?

In [8]:
climber_1.add_route_not_liked(routes.tail(100))

In [9]:
climber_1.add_route_liked(routes.head(100))

#### For clusters

In [10]:
climber_1.cluster

[10, -3, -11, 8, -4, -2, 1, 0, 0]

In [11]:
climber_1.get_cluster_order()

[0, 3, 6, 7, 8, 5, 1, 4, 2]

In [12]:
lst = climber_1.get_cluster_order()
[lst[len(lst)-idx-1] for idx in range(len(lst))]

[2, 4, 1, 5, 8, 7, 6, 3, 0]

In [13]:
len(lst)

9

In [14]:
climber_1.add_route_liked(routes.head(1346456))

In [15]:
climber_1.cluster

[6571, 7045, 30489, 5609, 1329, 504, 1177, 1354, 1779]

In [16]:
climber_1.get_cluster_order()

[2, 1, 0, 3, 8, 7, 4, 6, 5]

In [17]:
climber_1.clear_routes()
display(climber_1.get_routes_climbed())

Empty DataFrame
Columns: [name_id, country, crag, sector, name, tall_recommend_sum, grade_mean, cluster, rating_tot, liked]
Index: []